<<<<<<< HEAD
# Этап для сборки клиентского приложения
FROM node:14 as client
=======
FROM node:16 as client
>>>>>>> 20ddbca46a984efee8b2179f180fb31240f4f2cd

# Устанавливаем рабочую директорию для клиентского приложения
WORKDIR /app/client

# Копируем файл package.json из директории client в директорию контейнера для клиентского приложения
COPY client/package.json /app/client

# Устанавливаем зависимости npm для клиентского приложения
RUN npm install

# Копируем файлы клиентского приложения в директорию контейнера для клиентского приложения
COPY client /app/client

# Собираем клиентское приложение
RUN npm run build

# Этап для серверного приложения
FROM node:16-alpine

# Устанавливаем рабочую директорию для серверного приложения
WORKDIR /app

# Копируем файл package.json из директории server в корневую директорию контейнера
COPY server/package.json /app

# Устанавливаем зависимости npm для серверного приложения
RUN npm install

# Установка cross-env
RUN npm install -g cross-env

# Копируем файлы серверного приложения в корневую директорию контейнера
COPY server /app

# Копируем собранные файлы клиентского приложения из этапа сборки клиентского приложения в директорию клиента серверного приложения
COPY --from=client /app/client/build /app/client

# Открываем порт 8080 для внешних соединений
EXPOSE 8080

# Команда для запуска серверного приложения
CMD ["cross-env", "NODE_ENV=production", "node", "app.js"]
